RIET/src/AccumulationRegisters/InvoiceLinesCosts/InvoiceLinesCosts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>InvoiceLinesCosts</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаФискальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЭлементФормированияСтоимости</name>
    <type>
      <types>CatalogRef.ЭлементыФормированияСтоимости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтрокаИнвойса</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ExportRequest</types>
      <types>DocumentRef.ГТД</types>
      <types>DocumentRef.Service</types>
      <types>DocumentRef.Инвойс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ERPTreatment</name>
    <type>
      <types>EnumRef.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Activity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УДАЛИТЬAccount</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/InformationRegisters/CustomsFilesOfGoods/CustomsFilesOfGoods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CustomsFilesOfGoods</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </resources>
  <resources>
    <name>DTNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DTLineNo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/rgsPriorityTNVEDOverMinTNVED/rgsPriorityTNVEDOverMinTNVED.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>rgsPriorityTNVEDOverMinTNVED</name>
  <resources>
    <name>TNVED</name>
    <type>
      <types>CatalogRef.TNVEDCodes</types>
    </type>
  </resources>
  <dimensions>
    <name>Catalog</name>
    <type>
      <types>CatalogRef.Catalog</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Documents/КонсолидированныйПакетЗаявокНаПеревозку/КонсолидированныйПакетЗаявокНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонсолидированныйПакетЗаявокНаПеревозку</name>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <attributes>
    <name>ИмпортЭкспорт</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>GOLD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectlyToTheHub</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Seller</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>MOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
  <attributes>
    <name>RequestedPOA</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgency</name>
    <type>
      <types>EnumRef.Urgencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВажности</name>
    <type>
      <types>EnumRef.СтатусыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Requested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accepted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCAFirstResponse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Granted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Booked</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStage</name>
    <type>
      <types>EnumRef.DOCStages</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatus</name>
    <type>
      <types>EnumRef.DOCStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatusDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WithoutGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HouseKeeping</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentComment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>650</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>SegmentsList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SanctionedItems</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PendingEUC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>COORequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>FormalGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteeLetterRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceLocation</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionSpecialist</name>
    <type>
      <types>CatalogRef.SLSRCA</types>
    </type>
  </attributes>
  <attributes>
    <name>SubmittedByTransactionSpecialist</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>GL_FromSegment</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCAReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCA_Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ReRoute</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfUniqueLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Инвойсы</name>
    <attributes>
      <name>Инвойс</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ManualStatuses</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>EnumRef.DOCStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Version</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TMS_OB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ApprovalBorgs</name>
    <attributes>
      <name>Borg</name>
      <type>
        <types>CatalogRef.BORGs</types>
      </type>
    </attributes>
    <attributes>
      <name>Approve</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ApproveDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TNVEDCodesOfBroker</name>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>TNVEDBroker</name>
      <type>
        <types>CatalogRef.TNVEDCodes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/InvoiceLinesClassification/InvoiceLinesClassification.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InvoiceLinesClassification</name>
  <attributes>
    <name>InvoiceLinesMatching</name>
    <type>
      <types>DocumentRef.ЗакрытиеПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Classification</name>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Translation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DoNotVerifyWithCatalog</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/CommonForms/TNVEDHistory/Module.bsl
// RGS ASeryakov 19/01/2018 12:00:00 AM S-I-0004008

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АвтоЗаголовок  = Ложь;
	КаталогПолучен = "";
		
	Если Параметры.Свойство("Catalog") И ЗначениеЗаполнено(Параметры.Catalog) Тогда
		
		Catalog = Параметры.Catalog;
		TNVEDSLB = Параметры.TNVEDSLB;
		TNVEDSLBCurrent = Параметры.TNVEDSLB;
		TNVEDSLBRateCurrent = Параметры.TNVEDSLB.Rate;
		
		PartNo = СокрЛП(Строка(Параметры.Catalog));
		PR = Параметры.PR;
		
	Иначе
		КаталогПолучен = " <""Catalog"" не определен!>";
	КонецЕсли;
	
	Заголовок = "TNVEDHistory " + Параметры.PartNoПредставление + КаталогПолучен;
	
	Запрос = Новый Запрос;
	запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ParentCompany КАК ParentCompany,
	|	ВложенныйЗапрос.Segment КАК Segment,
	|	ВложенныйЗапрос.AU КАК AU,
	|	ВложенныйЗапрос.ERPTreatment КАК ERPTreatment,
	|	ВложенныйЗапрос.InvoiceLine КАК InvoiceLine,
	|	ВложенныйЗапрос.CostsAllocationDate КАК CostsAllocationDate
	|ПОМЕСТИТЬ InvoiceLinesCostsОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		InvoiceLinesCostsОбороты.SoldTo КАК ParentCompany,
	|		InvoiceLinesCostsОбороты.Segment КАК Segment,
	|		InvoiceLinesCostsОбороты.AU КАК AU,
	|		InvoiceLinesCostsОбороты.ERPTreatment КАК ERPTreatment,
	|		InvoiceLinesCostsОбороты.СтрокаИнвойса КАК InvoiceLine,
	|		InvoiceLinesCostsОбороты.Период КАК CostsAllocationDate
	|	ИЗ
	|		РегистрНакопления.InvoiceLinesCosts.Обороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				Регистратор,
	|				ЭлементФормированияСтоимости = ЗНАЧЕНИЕ(Справочник.ЭлементыФормированияСтоимости.ИнвойсПеревозка)
	|					И СтрокаИнвойса.Инвойс <> ЗНАЧЕНИЕ(Документ.Инвойс.ПустаяСсылка)
	|					И СтрокаИнвойса.КодПоИнвойсу = &PartNo
	|					И СтрокаИнвойса.Инвойс В
	|						(ВЫБРАТЬ
	|							КонсолидированныйПакетЗаявокНаПеревозкуИнвойсы.Инвойс
	|						ИЗ
	|							Документ.Поставка.УпаковочныеЛисты КАК ПоставкаУпаковочныеЛисты
	|								ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонсолидированныйПакетЗаявокНаПеревозку.Инвойсы КАК КонсолидированныйПакетЗаявокНаПеревозкуИнвойсы
	|								ПО
	|									ПоставкаУпаковочныеЛисты.УпаковочныйЛист = КонсолидированныйПакетЗаявокНаПеревозкуИнвойсы.Ссылка
	|						ГДЕ
	|							ПоставкаУпаковочныеЛисты.Ссылка.Cleared >= &Cleared)) КАК InvoiceLinesCostsОбороты
	|	{ГДЕ
	|		InvoiceLinesCostsОбороты.SoldTo.* КАК ParentCompany,
	|		InvoiceLinesCostsОбороты.Segment.*,
	|		InvoiceLinesCostsОбороты.AU.*,
	|		InvoiceLinesCostsОбороты.ERPTreatment.*,
	|		InvoiceLinesCostsОбороты.СтрокаИнвойса.* КАК InvoiceLine}) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.InvoiceLine,
	|	ВложенныйЗапрос.Segment,
	|	ВложенныйЗапрос.AU,
	|	ВложенныйЗапрос.ERPTreatment,
	|	ВложенныйЗапрос.CostsAllocationDate,
	|	ВложенныйЗапрос.ParentCompany
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	InvoiceLine
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	InvoiceLinesCostsОбороты.ParentCompany КАК ParentCompany,
	|	InvoiceLinesCostsОбороты.Segment КАК Segment,
	|	InvoiceLinesCostsОбороты.AU КАК AU,
	|	InvoiceLinesCostsОбороты.ERPTreatment КАК ERPTreatment,
	|	InvoiceLinesCostsОбороты.InvoiceLine КАК InvoiceLine,
	|	InvoiceLinesCostsОбороты.InvoiceLine.СтрокаЗаявкиНаЗакупку КАК POLine,
	|	InvoiceLinesCostsОбороты.InvoiceLine.СтрокаЗаявкиНаЗакупку.Владелец КАК PO,
	|	InvoiceLinesCostsОбороты.InvoiceLine.Инвойс КАК Invoice,
	|	CustomsFilesOfGoods.CustomsFile КАК CCD,
	|	InvoiceLinesClassificationClassification.Type КАК Type,
	|	InvoiceLinesClassificationClassification.Translation КАК Translation,
	|	РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.ПроводкаDSSСКП КАК ПроводкаDSSСКП,
	|	РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.Ссылка КАК РИЗП,
	|	InvoiceLinesCostsОбороты.CostsAllocationDate КАК CostsAllocationDate,
	|	InvoiceLinesCostsОбороты.InvoiceLine.НомерЗаявкиНаЗакупку КАК PONo,
	|	ВЫРАЗИТЬ(InvoiceLinesCostsОбороты.InvoiceLine.НаименованиеТовара КАК СТРОКА(300)) КАК DescriptionEng,
	|	СтрокиГТД.Ссылка КАК CCDLine,
	|	СтрокиГТД.ТНВЭД КАК TNVED,
	|	СтрокиГТД.ТНВЭД.Rate КАК TNVEDRate
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	InvoiceLinesCostsОбороты КАК InvoiceLinesCostsОбороты
	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CustomsFilesOfGoods КАК CustomsFilesOfGoods
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтрокиГТД КАК СтрокиГТД
	|			ПО CustomsFilesOfGoods.CustomsFile = СтрокиГТД.ГТД
	|		ПО InvoiceLinesCostsОбороты.InvoiceLine = CustomsFilesOfGoods.Item}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.InvoiceLinesClassification.Classification КАК InvoiceLinesClassificationClassification
	|		ПО InvoiceLinesCostsОбороты.InvoiceLine = InvoiceLinesClassificationClassification.InvoiceLine
	|			И (НЕ InvoiceLinesClassificationClassification.Ссылка.ПометкаУдаления)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеИмпортаПоЗакрытиюПоставки.СопоставлениеInvoiceLinesИDSS КАК РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS
	|		ПО InvoiceLinesCostsОбороты.InvoiceLine = РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.InvoiceLine
	|			И (НЕ РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.Ссылка.ПометкаУдаления)}
	|
	|СГРУППИРОВАТЬ ПО
	|	InvoiceLinesCostsОбороты.ParentCompany,
	|	InvoiceLinesCostsОбороты.Segment,
	|	InvoiceLinesCostsОбороты.AU,
	|	InvoiceLinesCostsОбороты.ERPTreatment,
	|	InvoiceLinesCostsОбороты.InvoiceLine,
	|	InvoiceLinesCostsОбороты.InvoiceLine.СтрокаЗаявкиНаЗакупку,
	|	InvoiceLinesCostsОбороты.InvoiceLine.СтрокаЗаявкиНаЗакупку.Владелец,
	|	InvoiceLinesCostsОбороты.InvoiceLine.Инвойс,
	|	CustomsFilesOfGoods.CustomsFile,
	|	InvoiceLinesClassificationClassification.Type,
	|	InvoiceLinesClassificationClassification.Translation,
	|	РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.ПроводкаDSSСКП,
	|	РаспределениеИмпортаПоЗакрытиюПоставкиСопоставлениеInvoiceLinesИDSS.Ссылка,
	|	InvoiceLinesCostsОбороты.CostsAllocationDate,
	|	InvoiceLinesCostsОбороты.InvoiceLine.НомерЗаявкиНаЗакупку,
	|	ВЫРАЗИТЬ(InvoiceLinesCostsОбороты.InvoiceLine.НаименованиеТовара КАК СТРОКА(300)),
	|	СтрокиГТД.Ссылка,
	|	СтрокиГТД.ТНВЭД,
	|	СтрокиГТД.ТНВЭД.Rate
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ParentCompany КАК ParentCompany,
	|	ВТ.Segment КАК Segment,
	|	ВТ.AU КАК AU,
	|	ВТ.ERPTreatment КАК ERPTreatment,
	|	ВТ.InvoiceLine КАК InvoiceLine,
	|	ВТ.POLine КАК POLine,
	|	ВТ.PO КАК PO,
	|	ВТ.Invoice КАК Invoice,
	|	ВТ.CCD КАК CCD,
	|	ВТ.Type КАК Type,
	|	ВТ.Translation КАК Translation,
	|	ВТ.ПроводкаDSSСКП КАК ПроводкаDSSСКП,
	|	ВТ.РИЗП КАК РИЗП,
	|	ВТ.CostsAllocationDate КАК CostsAllocationDate,
	|	ВТ.PONo КАК PONo,
	|	ВТ.DescriptionEng КАК DescriptionEng,
	|	ВТ.CCDLine КАК CCDLine,
	|	ВТ.TNVED КАК TNVED,
	|	ВЫБОР
	|		КОГДА НЕ ВТ.TNVEDRate ПОДОБНО """"
	|			ТОГДА ВТ.TNVEDRate
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК TNVEDRate
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТоварыСтрокГТД КАК ТоварыСтрокГТД
	|		ПО ВТ.CCDLine = ТоварыСтрокГТД.Владелец
	|			И (ТоварыСтрокГТД.МаркировкаТовара ПОДОБНО ""%"" + ВТ.InvoiceLine.КодПоИнвойсу + ""%"")
	|ГДЕ
	|	НЕ ТоварыСтрокГТД.МаркировкаТовара = """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ParentCompany,
	|	ВТ.Segment,
	|	ВТ.AU,
	|	ВТ.ERPTreatment,
	|	ВТ.InvoiceLine,
	|	ВТ.POLine,
	|	ВТ.PO,
	|	ВТ.Invoice,
	|	ВТ.CCD,
	|	ВТ.Type,
	|	ВТ.Translation,
	|	ВТ.ПроводкаDSSСКП,
	|	ВТ.РИЗП,
	|	ВТ.CostsAllocationDate,
	|	ВТ.PONo,
	|	ВТ.DescriptionEng,
	|	ВТ.CCDLine,
	|	ВТ.TNVED,
	|	ВЫБОР
	|		КОГДА НЕ ВТ.TNVEDRate ПОДОБНО """"
	|			ТОГДА ВТ.TNVEDRate
	|		ИНАЧЕ ""0""
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода", Дата("01.01.2015 00:00:00"));
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата());
	Запрос.УстановитьПараметр("PartNo", СокрЛП(Параметры.PartNo.Код));
	Запрос.УстановитьПараметр("Cleared", Дата("01.01.2017 00:00:00"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	History.Загрузить(Результат);
	
	HistoryКолВо = History.Количество() > 0;
	Элементы.ФормаУстановитьPriorityTNVED.Доступность =  HistoryКолВо;
	Элементы.ФормаУдалитьPriorityTNVED.Доступность = HistoryКолВо;
	
	ЗаполнитьМинимальныйTNVED();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьPriorityTNVEDНаСервере(TNVED, TNVEDSLBRate)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.rgsPriorityTNVEDOverMinTNVED.СоздатьНаборЗаписей();
	Набор.Записывать = Истина;
	Набор.Отбор.Catalog.Установить(Catalog);			
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		
		Набор[0].TNVED = TNVED;
		Набор.Записать();
	Иначе
		Запись = Набор.Добавить();
		Запись.Catalog = Catalog;
		Запись.TNVED   = TNVED;
		Набор.Записать(Ложь);
		
	КонецЕсли;	
	
	TNVEDSLBRate =  ПолучитьRateПоТНВЭДНаСервере(TNVED);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьPriorityTNVED(Команда)
	
	TNVED = Элементы.History.ТекущиеДанные.TNVED;
	
	Если НЕ ЗначениеЗаполнено(TNVED) Тогда
		
		ТекстСообщения = НСтр("ru = 'Для текущей строки не задан TNVED '; en = 'For the current row is not set TNVED'");				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	ИначеЕсли ЗначениеЗаполнено(TNVED) И TNVED = TNVEDSLB Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ВернутьСтр("ru = 'Необходимо установить значение TNVED отличное от ""%1""'; en = 'For the current row is not set TNVED'"), Строка(TNVED));				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	Иначе
		
		Попытка
			
			УстановитьPriorityTNVEDНаСервере(TNVED, TNVEDSLBRate);
			TNVEDSLB = ?(TNVED <> TNVEDSLB, TNVED, TNVEDSLB);
			TNVEDSLBRate = ?(TNVED <> TNVEDSLB, TNVED.Rate, TNVEDSLBRate);
			
			ОбновитьЗаголовокФормы(Истина);
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("Добавление", Истина);
			СтруктураПараметров.Вставить("TNVEDSLB", TNVEDSLB);
			СтруктураПараметров.Вставить("TNVEDSLBRate", Строка(TNVEDSLBRate));
			
			Оповестить("ОбновитьTNVEDSLB", СтруктураПараметров, ЭтотОбъект);
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьPriorityTNVEDНаСервере(Catalog)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.rgsPriorityTNVEDOverMinTNVED.СоздатьНаборЗаписей();
	Набор.Записывать = Истина;
	Набор.Отбор.Catalog.Установить(Catalog);			
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		
		Набор.Очистить();
		Набор.Записать();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьPriorityTNVED(Команда)
	
	Если  ЗначениеЗаполнено(Catalog) Тогда
		
		Попытка
			УдалитьPriorityTNVEDНаСервере(Catalog);
			ОбновитьЗаголовокФормы(Ложь);
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("Добавление", Ложь);
			
			Оповестить("ОбновитьTNVEDSLB", СтруктураПараметров, ЭтотОбъект);
			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Не задан Catalog '; en = 'Not set TNVED'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокФормы(Заполнение)
	
	Если Заполнение Тогда
		TNVEDSLBName = "TNVEDSLB(PR): ";
		Заголовок = "TNVEDHistory PartNo: " + PartNo + "; " + TNVEDSLBName + СокрЛП(Строка(TNVEDSLB)) + "; " + "Rate: " + TNVEDSLBRate;
	Иначе
		TNVEDSLBName = "TNVEDSLB: ";
		Заголовок = "TNVEDHistory PartNo: " + PartNo + "; " + TNVEDSLBName + СокрЛП(Строка(TNVEDSLBCurrent)) + "; " + "Rate: " + TNVEDSLBRateCurrent;
	КонецЕсли;
	
	
КонецПроцедуры // ПерезаполнитьФормыЗаголовокМинимальнымСтатусомТНВЭД()

&НаСервереБезКонтекста
Функция ПолучитьRateПоТНВЭДНаСервере(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TNVEDCodes.Rate
	|ИЗ
	|	Справочник.TNVEDCodes КАК TNVEDCodes
	|ГДЕ
	|	TNVEDCodes.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		
		Возврат Выборка.Rate;
	Иначе
		Возврат "";
	КонецЕсли;
	
	
	
КонецФункции // ПолучитьРатеПоТНВЭДНаСервере()

&НаСервере
Процедура ЗаполнитьМинимальныйTNVED()
	
	Таблица = History.Выгрузить(, "TNVED,TNVEDRate");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.TNVED,
	|	Таблица.TNVEDRate
	|ПОМЕСТИТЬ ТаблицаВТ
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВТ.TNVED КАК TNVED,
	|	ТаблицаВТ.TNVEDRate КАК TNVEDRate
	|ИЗ
	|	ТаблицаВТ КАК ТаблицаВТ";
	
	Запрос.УстановитьПараметр("Таблица",Таблица);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТаблицаРезультат = РГСофтКлиентСервер.ПодготовитьДанныеGoodsTNVED(РезультатЗапроса);
		
		TNVEDMinHistory = ТаблицаРезультат[0].TNVED;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьТекущийRateПоTNVED(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TNVEDCodes.Rate
	|ИЗ
	|	Справочник.TNVEDCodes КАК TNVEDCodes
	|ГДЕ
	|	TNVEDCodes.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		TNVEDSLBRate = Выборка.Rate;
		
	КонецЕсли;
	
КонецПроцедуры // TNVTNVEDSLB()
